let chartInSalesDatas = [
    {name:'فرو',
    هزینه:13000,
    درآمد:20000,
    },
    {name:'ارد',
    هزینه:10000,
    درآمد:5000,
    },
    {name:'خرد',
    هزینه:12000,
    درآمد:12000,
    },
    {name:'تیر',
    هزینه:18000,
    درآمد:19000,
    },
    {name:'مرد',
    هزینه:2000,
    درآمد:7000,
    },
    {name:'شهر',
    هزینه:4000,
    درآمد:5000,
    },
    {name:'مهر',
    هزینه:19000,
    درآمد:16000,
    },
    {name:'آبا',
    هزینه:6000,
    درآمد:4000,
    },
    {name:'آذر',
    هزینه:13000,
    درآمد:11000,
    },
    {name:'دی',
    هزینه:15000,
    درآمد:19000,
    },
    {name:'بهم',
    هزینه:20000,
    درآمد:18000,
    },
    {name:'اسف',
    هزینه:10000,
    درآمد:9000,
    },
    
]

let piChartInSalesDatas = [
    { name: "پوشاک", value: 300 },
    { name: "دیگر", value: 100 },
    { name: "الکترونیک", value: 400 },
  ]

  const barChartInSalesDatas = [
    {
      name: 'شنبه',
      درهفته: 2400,
    },
    {
      name: 'یکشنبه',
      درهفته: 1398,
    },
    {
      name: 'دوشنبه',
      درهفته: 1800,
    },
    {
      name: 'سه شنبه',
      درهفته: 3908,
    },
    {
      name: 'چهارشنبه',
      درهفته: 4800,
    },
    {
      name: 'پنج شنبه',
      درهفته: 3800,
    },
    {
      name: 'جمعه',
      درهفته: 4300,
    },
  ]

  const infoChartInRow3 = [
    {
      name: "Page A",
      فروشها: 60,

    },
    {
      name: "Page B",
      فروشها: 40,

    },
    {
      name: "Page C",
      فروشها: 32,

    },
    {
      name: "Page D",
      فروشها: 27,

    },
    {
      name: "Page E",
      فروشها: 49,

    },
    {
      name: "Page F",
      فروشها: 20,

    },
    {
      name: "Page G",
      فروشها: 32,

    },
    {
      name: "Page G",
      فروشها: 44,

    },
    {
      name: "Page G",
      فروشها: 56,

    },
    {
      name: "Page G",
      فروشها: 30,

    },
  ]


  const lineChartInfos= [
    {
      name: "Page A",
      uv: 4000,
      بازدید: 10,
      amt: 2400,
    },
    {
      name: "Page B",
      uv: 3000,
      بازدید: 9,
      amt: 2210,
    },
    {
      name: "Page C",
      uv: 2000,
      بازدید: 15,
      amt: 2290,
    },
    {
      name: "Page D",
      uv: 2780,
      بازدید: 12,
      amt: 2000,
    },
    {
      name: "Page E",
      uv: 1890,
      بازدید: 14,
      amt: 2181,
    },
    {
      name: "Page F",
      uv: 2390,
      بازدید: 18,
      amt: 2500,
    },
    {
      name: "Page G",
      uv: 3490,
      بازدید: 11,
      amt: 2100,
    },
  ]

  let chartInAnalyzeRow2Datas = [
    {name:'فرو',
    مستقیم:20,
    ارگانیک:50,
    },
    {name:'ارد',
    مستقیم:44,
    ارگانیک:23,
    },
    {name:'خرد',
    مستقیم:76,
    ارگانیک:13,
    },
    {name:'تیر',
    مستقیم:10,
    ارگانیک:19,
    },
    {name:'مرد',
    مستقیم:63,
    ارگانیک:36,
    },
    {name:'شهر',
    مستقیم:86,
    ارگانیک:47,
    },
    {name:'مهر',
    مستقیم:39,
    ارگانیک:53,
    },
    {name:'آبا',
    مستقیم:65,
    ارگانیک:36,
    },
    {name:'آذر',
    مستقیم:28,
    ارگانیک:57,
    },
    {name:'دی',
    مستقیم:64,
    ارگانیک:51,
    },
    {name:'بهم',
    مستقیم:39,
    ارگانیک:42,
    },
    {name:'اسف',
    مستقیم:11,
    ارگانیک:18,
    },
    
]
export {chartInSalesDatas,piChartInSalesDatas,barChartInSalesDatas,infoChartInRow3,lineChartInfos,chartInAnalyzeRow2Datas}